victor999/nrf52-temperature-meter/sensorBall/src/sensor_beacon.c
#define ADC_RESULT_IN_MILLI_VOLTS(ADC_VALUE)\
        ((((ADC_VALUE) * ADC_REF_VOLTAGE_IN_MILLIVOLTS) / ADC_RES_12BIT) * ADC_PRE_SCALING_COMPENSATION)

void saadc_init(void);

static nrf_saadc_value_t       m_buffer_pool[2][SAADC_SAMPLES_IN_BUFFER];
static uint32_t                m_adc_evt_counter = 0;
static bool                    m_saadc_calibrate = false; 

uint32_t g_batteryVoltage_mv = 0;


/* The beacon types.
 */
typedef enum
{
    M_BEACON_PDU_TYPE_TEMP_ONLY = 0,    ///< Beacon with only temperature data.
		M_BEACON_PDU_TYPE_TEMP_BATT					///< Beacon with both temperature and battery data.
} m_beacon_pdu_type_t;


static bool volatile m_radio_isr_called;    /* Indicates that the radio ISR has executed. */
static bool volatile m_rtc_isr_called;      /* Indicates that the RTC ISR has executed. */
static uint32_t m_time_us;                  /* Keeps track of the latest scheduled point in time. */
static uint32_t m_skip_read_counter = 0;    /* Keeps track on when to read the sensor. */
static uint8_t m_adv_pdu[40];               /* The RAM representation of the advertising PDU. */


/* Initializes the beacon advertising PDU.
 */
static void m_beacon_pdu_init(uint8_t * p_beacon_pdu)
{
    p_beacon_pdu[0] = 0x42;
    p_beacon_pdu[1] = 0;
    p_beacon_pdu[2] = 0;
}


/* Sets the BLE address field in the sensor beacon PDU.
 */
static void m_beacon_pdu_bd_addr_default_set(uint8_t * p_beacon_pdu)
{
    if ( ( NRF_FICR->DEVICEADDR[0]           != 0xFFFFFFFF)
    ||   ((NRF_FICR->DEVICEADDR[1] & 0xFFFF) != 0xFFFF) )
    {
        p_beacon_pdu[BD_ADDR_OFFS    ] = (NRF_FICR->DEVICEADDR[0]      ) & 0xFF;
        p_beacon_pdu[BD_ADDR_OFFS + 1] = (NRF_FICR->DEVICEADDR[0] >>  8) & 0xFF;
        p_beacon_pdu[BD_ADDR_OFFS + 2] = (NRF_FICR->DEVICEADDR[0] >> 16) & 0xFF;
        p_beacon_pdu[BD_ADDR_OFFS + 3] = (NRF_FICR->DEVICEADDR[0] >> 24)       ;
        p_beacon_pdu[BD_ADDR_OFFS + 4] = (NRF_FICR->DEVICEADDR[1]      ) & 0xFF;
        p_beacon_pdu[BD_ADDR_OFFS + 5] = (NRF_FICR->DEVICEADDR[1] >>  8) & 0xFF;
    }
    else
    {
        static const uint8_t random_bd_addr[M_BD_ADDR_SIZE] = {0xE2, 0xA3, 0x01, 0xE7, 0x61, 0xF7};
        memcpy(&(p_beacon_pdu[3]), &(random_bd_addr[0]), M_BD_ADDR_SIZE);
    }
    
    p_beacon_pdu[1] = (p_beacon_pdu[1] == 0) ? M_BD_ADDR_SIZE : p_beacon_pdu[1];
}


/* Resets the sensor data of the sensor beacon PDU.
 */
static void m_beacon_pdu_sensor_data_reset(uint8_t * p_beacon_pdu, m_beacon_pdu_type_t beacon_pdu_type)
{
    switch ( beacon_pdu_type )
    {
        case M_BEACON_PDU_TYPE_TEMP_ONLY:
            {
                static const uint8_t beacon_temp_only[31] = 
                {
                    0x02,
                    0x01, 0x04,
                    0x03,
                    0x19, 0x00, 0x03,
                    0x07,
                    0x09, 0x54, 0x65, 0x6D, 0x70, 0x6F, 0x20,
                    0x07,
                    0x03, 0x02, 0x18, 0x09, 0x18, 0x0A, 0x18,
                    0x07,
                    0x16, 0x09, 0x18, 0xA3, 0x70, 0x45, 0x41,
                };
                memcpy(&(p_beacon_pdu[3 + M_BD_ADDR_SIZE]), &(beacon_temp_only[0]), sizeof(beacon_temp_only));
                p_beacon_pdu[1] = M_BD_ADDR_SIZE + sizeof(beacon_temp_only);
            }
            break;
				case M_BEACON_PDU_TYPE_TEMP_BATT:
            {
                static const uint8_t beacon_temp_bat[18] = 
                {
                    0x02,
                    0x01, 0x04,
                    0x03,
                    0x03, 0xE5, 0xFE,
                    /* Entry for temperature characteristics. Ref:
                       sint16, https://developer.bluetooth.org/gatt/characteristics/Pages/CharacteristicViewer.aspx?u=org.bluetooth.characteristic.temperature.xml */
                    0x05,
                    0x16, 0x6E, 0x2A, 0x00, 0x00,               
                    /* Entry for battery characteristics. Ref:
                       uint32, https://developer.bluetooth.org/gatt/characteristics/Pages/CharacteristicViewer.aspx?u=org.bluetooth.characteristic.battery_level.xml */
                    0x04,
                    0x16, 0x19, 0x2A, 0x00,   
                };
                memcpy(&(p_beacon_pdu[3 + M_BD_ADDR_SIZE]), &(beacon_temp_bat[0]), sizeof(beacon_temp_bat));
                p_beacon_pdu[1] = M_BD_ADDR_SIZE + sizeof(beacon_temp_bat);
            }
            break;
        default:
            break;
    }
}


/* Sets the sensor data of the sensor beacon PDU.
 */
static void m_beacon_pdu_sensor_data_set(uint8_t * p_beacon_pdu, int32_t *p_temperature, uint8_t *p_battery_level, m_beacon_pdu_type_t beacon_pdu_type)
{
	if ( (p_battery_level != NULL)&& (p_temperature != NULL) )
  {
		switch(beacon_pdu_type)
		{
			case M_BEACON_PDU_TYPE_TEMP_ONLY:
				/* The temperature is in Celsius with one decimal, so
           deviding the value by an additional 100. */
        p_beacon_pdu[FLOAT32_TEMPERATURE_OFFS    ] = ((*p_temperature / 100)     ) & 0xFF;
        p_beacon_pdu[FLOAT32_TEMPERATURE_OFFS + 1] = ((*p_temperature / 100) >> 8) & 0xFF;
        p_beacon_pdu[FLOAT32_TEMPERATURE_OFFS + 2] = 0x00;
        p_beacon_pdu[FLOAT32_TEMPERATURE_OFFS + 3] = 0xFF;
				break;
			case M_BEACON_PDU_TYPE_TEMP_BATT:
				/* Battery (Bluetooth standard) is in Percents*/
        p_beacon_pdu[UINT8_BATT_OFFS] = ((*p_battery_level)      ) & 0xFF;
        /* The temperature (Bluetooth standard) is in Celsius with two decimals, so
           deviding the value by an additional 10. */
        p_beacon_pdu[SINT16_TEMPERATURE_OFFS    ] = ((*p_temperature / 10)     ) & 0xFF;
        p_beacon_pdu[SINT16_TEMPERATURE_OFFS + 1] = ((*p_temperature / 10) >> 8) & 0xFF;
				break;
		}
	}
}


/* Waits for the next NVIC event.
 */
#ifdef __GNUC__
static void __INLINE cpu_wfe(void)
#else
static void __forceinline cpu_wfe(void)
#endif
{
    DBG_WFE_BEGIN;
    __WFE();
    __SEV();
    __WFE();
    DBG_WFE_END;
}


/* Hook for the access mode feature of the mcp9808 driver.
 */
static void cpu_sleep_hook(void)
{
    cpu_wfe();
}

void wait_for_timer(void)
{
		while ( !m_rtc_isr_called )
		{
				cpu_wfe();
		}
}


/* Powers up the the mcp9808 device and TWI pull-up resistors.
 */
static void sensor_chip_powerup(void)
{
    static const drv_mcp9808_cfg_t m_drv_mcp9808_cfg =
    {
        .twi_id = HAL_TWI_ID_TWI0,
        .twi_cfg.address   = (0x18 << TWI_ADDRESS_ADDRESS_Pos),
        .twi_cfg.frequency = (TWI_FREQUENCY_FREQUENCY_K400 << TWI_FREQUENCY_FREQUENCY_Pos),
        .p_sleep_hook = cpu_sleep_hook,
    };
    
    if ( drv_mcp9808_open(&m_drv_mcp9808_cfg) == DRV_MCP9808_STATUS_CODE_SUCCESS )
    {
        drv_mcp9808_access_mode_set(DRV_MCP9808_ACCESS_MODE_CPU_INACTIVE);
    
        set_normal_mode();
    }
    else
    {
        (void)drv_mcp9808_close();
    }   
}


